In [1]:
#import dependancies
import pandas as pd 
import pprint as pp 
import json
import requests

#testing JSON URL to see it visually
url = 'https://datausa.io/api/data?drilldowns=Nation&measures=Population'
results = requests.get(url).json()
results["data"][1]

{'ID Nation': '01000US',
 'Nation': 'United States',
 'ID Year': 2017,
 'Year': '2017',
 'Population': 325719178,
 'Slug Nation': 'united-states'}

In [2]:
#setting up query 1 for age group data
query_1_url = 'https://datausa.io/api/data?Geography=16000US0644000&measures=Birthplace,Birthplace%20Moe&drilldowns=Age'
results_1 = requests.get(query_1_url).json()
results_1['data'][1]

{'ID Age': 10,
 'Age': '75 Years & Over',
 'ID Year': 2018,
 'Year': '2018',
 'Birthplace': 216817,
 'Birthplace Moe': 6002.368865706271,
 'Geography': 'Los Angeles, CA',
 'ID Geography': '16000US0644000',
 'Slug Geography': 'los-angeles-ca'}

In [3]:
#setting up query 2 for income data
query_2_url = 'https://datausa.io/api/data?measure=Household%20Income%20by%20Race,Household%20Income%20by%20Race%20Moe&Geography=16000US0644000:parents,16000US0644000,16000US0644000:similar'
results_2 = requests.get(query_2_url).json()
results_2['data'][1]

{'ID Year': 2018,
 'Year': '2018',
 'Household Income by Race': 61937,
 'Household Income by Race Moe': 94,
 'Geography': 'United States',
 'ID Geography': '01000US',
 'Slug Geography': 'united-states'}

In [20]:
#query 1 loop to getting age group data
query_1_url = 'https://datausa.io/api/data?Geography=16000US0644000&measures=Birthplace,Birthplace%20Moe&drilldowns=Age'

years = [2013,2014,2015,2016,2017,2018]

city_data_1 = {
    "Year": [],
    "City": [],
    "Age Range": [],
    "Number in Range": []

}

results_1 = requests.get(query_1_url).json()

for year in years:
    for i in range(len(results_1['data'])):
        try:
            results_1 = requests.get(query_1_url).json()
            city_data_1["City"].append(results_1['data'][i]['Geography'])
            city_data_1["Year"].append(results_1['data'][i]['Year'])
            city_data_1["Age Range"].append(results_1['data'][i]['Age'])
            city_data_1["Number in Range"].append(results_1['data'][i]['Birthplace'])
        except:
            pass

In [21]:
#query 2 loop for getting income data
query_2_url = 'https://datausa.io/api/data?measure=Household%20Income%20by%20Race,Household%20Income%20by%20Race%20Moe&Geography=16000US0644000:parents,16000US0644000,16000US0644000:similar'

years = [2013,2014,2015,2016,2017,2018]

city_data_2 = {
    "Year": [],
    "City": [],
    "Household Income by Race": []
}

results_2 = requests.get(query_2_url).json()

for year in years:
    for i in range(len(results_2['data'])):
        try:       
            results_2 = requests.get(query_2_url).json()
            city_data_2['City'].append(results_2['data'][i]['Geography'])
            city_data_2['Household Income by Race'].append(results_2['data'][i]['Household Income by Race'])
            city_data_2['Year'].append(results_2['data'][i]['Year'])
        except:
            pass

In [22]:
#first dataframe
city_df_1 = pd.DataFrame(city_data_1)
city_df_1.head()

   Year             City        Age Range  Number in Range
0  2018  Los Angeles, CA   18 to 24 Years           400942
1  2018  Los Angeles, CA  75 Years & Over           216817
2  2018  Los Angeles, CA   45 to 54 Years           513173
3  2018  Los Angeles, CA    Under 5 Years           228554
4  2018  Los Angeles, CA   65 to 74 Years           295610

In [23]:
#second dataframe
city_data_2 ={
    "Year": year_results_2,
    "City": city_2,
    "Median Household Income": med_household_income,
}
city_df_2 = pd.DataFrame(city_data_2)
city_df_2 = city_df_2.loc[city_df_2['City']== 'Los Angeles, CA']
city_df_2.head()

    Year             City  Median Household Income
2   2018  Los Angeles, CA                    62474
7   2017  Los Angeles, CA                    60197
12  2016  Los Angeles, CA                    54432
17  2015  Los Angeles, CA                    52024
22  2014  Los Angeles, CA                    50544

In [19]:
#merge dataframes to get unified data
city_data_clean = pd.merge(city_df_1, city_df_2, on='City', how='left')
city_data_clean = city_data_clean[['Year_x','City','Age Range','Number in Range','Median Household Income']]
city_data_clean

,Year_x,City,Age Range,Number in Range,Median Household Income
0,2018,"Los Angeles, CA",18 to 24 Years,400942,62474
1,2018,"Los Angeles, CA",18 to 24 Years,400942,60197
2,2018,"Los Angeles, CA",18 to 24 Years,400942,54432
3,2018,"Los Angeles, CA",18 to 24 Years,400942,52024
4,2018,"Los Angeles, CA",18 to 24 Years,400942,50544
...,...,...,...,...,...
14251,2013,"Los Angeles, CA",Under 5 Years,249942,60197
14252,2013,"Los Angeles, CA",Under 5 Years,249942,54432
14253,2013,"Los Angeles, CA",Under 5 Years,249942,52024
14254,2013,"Los Angeles, CA",Under 5 Years,249942,50544
14255,2013,"Los Angeles, CA",Under 5 Years,249942,48466

In [9]:
#pulling in geo-codes
geo_data = "all-geocodes-v2018 (1).xlsx"
geo_codes = pd.read_excel(geo_data, index_col=0, header=4).reset_index()
geo_codes = geo_codes[['State Code (FIPS)','Place Code (FIPS)','Area Name (including legal/statistical area description)']]
geo_codes

,State Code (FIPS),Place Code (FIPS),Area Name (including legal/statistical area description)
0,0,0,United States
1,1,0,Alabama
2,1,0,Autauga County
3,1,0,Baldwin County
4,1,0,Barbour County
...,...,...,...
43842,72,0,Vega Baja Municipio
43843,72,0,Vieques Municipio
43844,72,0,Villalba Municipio
43845,72,0,Yabucoa Municipio
43846,72,0,Yauco Municipio